using System;

namespace Less5Ex1
{
    /*
     * Долгуев Владимир.
     * 1. Создать класс рациональных чисел.
     * В классе два поля – числитель и знаменатель.
     * Предусмотреть конструктор.
     * Определить операторы ==, != (метод Equals()), <, >, <=, >=, +, –, ++, --.
     * Переопределить метод ToString() для вывода дроби.
     * Определить операторы преобразования типов между типом дробь,float, int.
     * Определить операторы *, /, %.
     */

    internal class Program
    {
        private static void Main()
        {
            // все тестирование выполнено в проекте Less5.xUnit
            Console.ReadKey();
        }
    }
}